---
type: InSessionPrintSetting
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# InSessionPrintSetting

`Autodesk.Revit.DB.InSessionPrintSetting` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Property | PrintParameters | — | `public virtual PrintParameters PrintParameters { get ; }` |